package 과제.step4;

public class Level1 {


  //	      1. 객체 란 ?
  // 객체(Object)란 물리적으로 존재하거나 추상적으로 생각할 수 있는 것 중에서 자신과 다른 것을 식별가능한 것을 말한다.

  //        2. 클래스 란 ?
  // 멤버 변수와 메서드를 가지는 객체를 만들기 위한 확장이 가능한 코드 양식입니다.(코드의 설계도라고 할수 있다.)

  //        3. 멤버변수/필드/속성/특성 이란?
  // 멤버변수  : 클래스 영역에서 선언된 변수를 멤버변수라고 한다.
  // 필드     : 클래스를 구성하는 요소 중 하나로 클래스 내부 멤버이다.
  // 속성     : 클래스내에 있는 변수, 곧 객체의 상태를 말한다.
  // 특성     : 가장 큰 특징은 컴파일된 코드가 플랫폼 독립적이라는 점이다.

  //        4. 지역변수 와 멤버변수의 차이점을 서술하시오.
  // 변수를 선언하는 위치에 따라 멤버변수와 지역변수로 나눌 수 있다.
  // 멤버변수는 선언 위치가 클래스 영역이고, 지역변수는 선언 위치가 메소드나 생성자 내부이다.



}





